# Визначити чи є введене з клавіатури число N простим

N = int(input("N = "))

# 4 - не просте, бо ділиться 2
# 5 - просте, бо воно ділиться ЛИШЕ на 1 та на себе (5)
# N - просте треба спробувати поділити його на всі числа від 2 до N-1

# напишемо цикл, що буде перебирати всі числа від 2 до N-1
# i = 2
# while i <= N-1:
#     print(i)
#     i = i + 1

# # у цьому циклі спобуємо ділити N на кожне з i: 2, 3, ... N-1
# i = 2
# while i <= N-1:
#     if N % i == 0: # якщо N поділилося без остачі на i
#         print(N, "- не просте, бо поділилося на ", i)
#     i = i + 1
#

# використаємо змінну індикатор, у якій буде True - якщо число просте та False, якщо число не просте
is_prime = True
i = 2
while i <= N-1:
    if N % i == 0: # якщо N поділилося без остачі на i
        # print(N, "- не просте, бо поділилося на ", i)
        is_prime = False
    i = i + 1

if is_prime:
    print(N, "- просте")
else:
    print(N, "- не просте")
