# підпрограма визначення чи є задане число простим
def isPrime(N):  # <= заголовок функції, містить імʼя та аргументи
    # використаємо змінну індикатор, у якій буде True - якщо число просте та False, якщо число не просте
    is_prime = True
    i = 2
    while i <= N-1:
        if N % i == 0: # якщо N поділилося без остачі на i
            # print(N, "- не просте, бо поділилося на ", i)
            is_prime = False
        i = i + 1

    return is_prime and N != 1 # <= повернення результату



###### Головна програма ###########

print(isPrime(127))

# нехай є список натуральних чисел,
# потрібно вивести ті з них, які є простими

lst = [12, 41, 29, 15, 11, 13, 9, 8, 2, 1]
#       -   +   +   -   +   +  -  -  +  -

# лишається застосувати цю задачу до кожного елементу списку
for n in lst:
    if isPrime(n):
        print(n)
