# підпрограма визначення чи є задане число простим
def isPrime(N):  # <= заголовок функції, містить імʼя та аргументи
    if N == 1:
        return False

    for i in range(2, N // 2 + 1):
        if N % i == 0: # якщо N поділилося без остачі на i
            return False

    return True  # <= повернення результату



###### Головна програма ###########

print(isPrime(1))
pass
print(isPrime(5))
pass


# нехай є список натуральних чисел,
# потрібно вивести ті з них, які є простими

lst = [12, 41, 29, 15, 11, 13, 9, 8, 2, 1]
#       -   +   +   -   +   +  -  -  +  -

# лишається застосувати цю задачу до кожного елементу списку
for n in lst:
    if isPrime(n):
        print(n)
