def two_max_values(lst: list):
    # припускаю, що список містить принаймні 2 елементи
    # lst = [1, 34, 12, 7, 124] => 34, 124
    lst.sort()
    # print(lst)
    return lst[-2], lst[-1]  # підпрограма повертає ДВА значення, розділених комою - кортеж значень

######## Main #########

# res_from_function = two_max_values([1, 34, 12, 7, 124])
# print(res_from_function)


prev_max, maximum = two_max_values([1, 34, 45, 12, 7, 124]) # тут відбувається операція розпакування кортежу,
                                                        # отже зліва від знака рівності має стояти стільки змінних, скільки значень повертає функція

print(prev_max, maximum)