# Визначити чи є введене з клавіатури число N простим

N = int(input("N = "))

# використаємо змінну індикатор, у якій буде True - якщо число просте та False, якщо число не просте
is_prime = True
for i in range(2, N):  # замість while використовую for
    if N % i == 0: # якщо N поділилося без остачі на i
        # print(N, "- не просте, бо поділилося на ", i)
        is_prime = False
        break # можемо перервати цикл, бо ми вже гарантовано знаємо, що число не просте


if is_prime:
    print(N, "- просте")
else:
    print(N, "- не просте")